Repository: garaged/WorkoutTracker
Catalog: workouttracker/Resources/Localizable.xcstrings
Source language: en
Languages: es_mx

# progress.dashboard.consistency.support.partial
source: Your routine is starting to take shape, but a few more finished weeks will make this trend steadier.
es_mx: Tu rutina empieza a tomar forma, pero unas semanas terminadas más harán esta tendencia más estable.

# progress.dashboard.consistency.title
source: Consistency
es_mx: Consistencia

# progress.dashboard.failure_title
source: Couldn’t load progress
es_mx: No se pudo cargar el progreso

# progress.dashboard.header_subtitle
source: A simple dashboard for strength, volume, consistency, and session efficiency.
es_mx: Un panel simple de fuerza, volumen, consistencia y eficiencia de la sesión.

# progress.dashboard.header_title
source: Training trends
es_mx: Tendencias de entrenamiento

# progress.dashboard.loading
source: Loading progress…
es_mx: Cargando progreso…

# progress.dashboard.low_data_banner
source: Some cards are already useful, while others still need more completed workouts or timing data to become trustworthy.
es_mx: Algunas tarjetas ya son útiles, mientras que otras todavía necesitan más entrenamientos completados o datos de tiempo para volverse confiables.

# progress.dashboard.recovery.comparison.building
source: Rest timing is still building.
es_mx: El tiempo de descanso todavía se está formando.

# progress.dashboard.recovery.comparison.earlier
source: Average rest finished %@ earlier than planned.
es_mx: En promedio, el descanso terminó %@ antes de lo planeado.

# progress.dashboard.recovery.comparison.longer
source: Average rest ran %@ longer than planned.
es_mx: En promedio, el descanso duró %@ más de lo planeado.

# progress.dashboard.recovery.comparison.matched
source: Average rest matched the plan closely.
es_mx: En promedio, el descanso coincidió bastante con lo planificado.

# progress.dashboard.recovery.comparison.partial
source: Some timing data is present, but planned-vs-actual rest still needs more sessions.
es_mx: Hay algunos datos de tiempo, pero la comparación entre descanso planificado y real aún necesita más sesiones.

# progress.dashboard.recovery.empty_message
source: Not enough timing data yet. Finish more sessions with rest metadata to unlock this card.
es_mx: Aún no hay suficientes datos de tiempo. Completa más sesiones con metadatos de descanso para desbloquear esta tarjeta.

# progress.dashboard.recovery.empty_support
source: Session timing and planned-vs-actual rest appear once enough completed sessions include timing data.
es_mx: El tiempo de sesión y la comparación entre descanso planificado y real aparecen cuando suficientes sesiones completadas incluyen datos de tiempo.

# progress.dashboard.recovery.headline
source: Recovery and efficiency
es_mx: Recuperación y eficiencia

# progress.dashboard.recovery.partial_message
source: Efficiency has partial timing data, but rest comparison still needs more logged sessions.
es_mx: La eficiencia tiene datos de tiempo parciales, pero la comparación de descanso todavía necesita más sesiones registradas.

# progress.dashboard.recovery.stat.actual_rest
source: Actual rest
es_mx: Descanso real

# progress.dashboard.recovery.stat.avg_session
source: Avg session
es_mx: Sesión prom.

# progress.dashboard.recovery.stat.planned_rest
source: Planned rest
es_mx: Descanso planificado

# progress.dashboard.recovery.title
source: Recovery
es_mx: Recuperación

# progress.dashboard.strength.badge.best
source: Best %@
es_mx: Mejor %@

# progress.dashboard.strength.badge.early
source: Early
es_mx: Inicial

# progress.dashboard.strength.badge.estimated_1rm
source: Est. 1RM %@
es_mx: 1RM est. %@

# progress.dashboard.strength.empty_headline
source: Strength highlights will appear here
es_mx: Los puntos destacados de fuerza aparecerán aquí

# progress.dashboard.strength.empty_message
source: Log a few completed strength sets to unlock exercise highlights, PRs, and latest top-set signals.
es_mx: Registra algunas series de fuerza completadas para desbloquear ejercicios destacados, PR y señales de tus mejores series recientes.

# progress.dashboard.strength.empty_summary
source: As you complete more logged sets, this card will surface your most relevant exercises and PR moments.
es_mx: A medida que completes más series registradas, esta tarjeta mostrará tus ejercicios más relevantes y tus mejores marcas.

# progress.dashboard.strength.headline.featured_exercises.one
source: %lld featured exercise
es_mx: %lld ejercicio destacado

# progress.dashboard.strength.headline.featured_exercises.other
source: %lld featured exercises
es_mx: %lld ejercicios destacados

# progress.dashboard.strength.headline.recent_prs.one
source: %lld recent PR
es_mx: %lld PR reciente

# progress.dashboard.strength.headline.recent_prs.other
source: %lld recent PRs
es_mx: %lld PR recientes

# progress.dashboard.strength.highlight.best_estimated_1rm
source: Best est. 1RM %@
es_mx: Mejor 1RM est. %@

# progress.dashboard.strength.highlight.best_weight
source: Best weight %@
es_mx: Mejor peso %@

# progress.dashboard.strength.highlight.history_building
source: Progress history is still building
es_mx: El historial de progreso aún se está formando

# progress.dashboard.strength.highlight.last_logged
source: Last logged %@
es_mx: Último registro %@

# progress.dashboard.strength.highlight.latest_top_set
source: Latest top set %lld × %@
es_mx: Última serie principal %lld × %@

# progress.dashboard.strength.low_data_title
source: Not enough strength history
es_mx: Aún no hay suficiente historial de fuerza

# progress.dashboard.strength.summary.with_pr
source: Recent PR activity is led by %@. Open an exercise to inspect deeper progress detail.
es_mx: La actividad reciente de PR la lidera %@. Abre un ejercicio para ver más detalle de progreso.

# progress.dashboard.strength.summary.without_pr.one
source: Recent logged strength work across %lld exercise. Open an exercise to inspect its detail view.
es_mx: Trabajo de fuerza reciente registrado en %lld ejercicio. Abre un ejercicio para ver su detalle.

# progress.dashboard.strength.summary.without_pr.other
source: Recent logged strength work across %lld exercises. Open an exercise to inspect its detail view.
es_mx: Trabajo de fuerza reciente registrado en %lld ejercicios. Abre un ejercicio para ver su detalle.

# progress.dashboard.strength.title
source: Strength
es_mx: Fuerza

# progress.dashboard.strength.top_name_fallback
source: your recent work
es_mx: tu trabajo reciente

# progress.dashboard.unavailable
source: Progress isn’t available yet.
es_mx: El progreso todavía no está disponible.

# progress.dashboard.volume.empty_headline
source: Weekly volume is still building
es_mx: El volumen semanal todavía se está formando

# progress.dashboard.volume.empty_message
source: Complete more workouts in this window to build weekly sets, reps, and load totals.
es_mx: Completa más entrenamientos dentro de esta ventana para construir totales semanales de series, repeticiones y carga.

# progress.dashboard.volume.empty_support
source: This card uses the latest completed week in the selected window. More completed workouts will make the weekly picture useful.
es_mx: Esta tarjeta usa la semana completada más reciente dentro de la ventana seleccionada. Más entrenamientos completados harán más útil la vista semanal.

# progress.dashboard.volume.headline
source: Latest weekly volume
es_mx: Volumen semanal más reciente

# progress.dashboard.volume.more_weeks_needed
source: More completed weeks are needed before the volume trend becomes trustworthy.
es_mx: Se necesitan más semanas completadas antes de que la tendencia de volumen sea confiable.

# progress.dashboard.volume.open_exercise_detail
source: Open exercise detail
es_mx: Abrir detalle del ejercicio

# progress.dashboard.volume.primary.sets
source: %lld sets
es_mx: %lld series

# progress.dashboard.volume.stat.exercises
source: Exercises
es_mx: Ejercicios

# progress.dashboard.volume.stat.reps
source: Reps
es_mx: Repeticiones

# progress.dashboard.volume.stat.sets
source: Sets
es_mx: Series

# progress.dashboard.volume.stat.workouts
source: Workouts
es_mx: Entrenamientos

# progress.dashboard.volume.support.with_duration
source: Latest completed week totals %lld sets and %lld reps across %lld workouts in %@.
es_mx: La semana completada más reciente suma %lld series y %lld repeticiones en %lld entrenamientos durante %@.

# progress.dashboard.volume.support.without_duration
source: Latest completed week totals %lld sets and %lld reps across %lld workouts.
es_mx: La semana completada más reciente suma %lld series y %lld repeticiones en %lld entrenamientos.

# progress.dashboard.volume.title
source: Volume
es_mx: Volumen

# progress.dashboard.window.value
source: Window: %@
es_mx: Ventana: %@

# progress.detail.empty.personal_records.message
source: Complete more quality sets for this exercise and PR summaries will appear here.
es_mx: Completa más series de calidad para este ejercicio y aquí aparecerán los resúmenes de PR.

# progress.detail.empty.personal_records.title
source: Personal records need more data
es_mx: Los récords personales necesitan más datos

# progress.detail.empty.recent_performance.message
source: Once this exercise has more completed sets, the latest performance samples will appear here.
es_mx: Cuando este ejercicio tenga más series completadas, aquí aparecerán las muestras de rendimiento más recientes.

# progress.detail.empty.recent_performance.title
source: Recent samples are unavailable
es_mx: Las muestras recientes no están disponibles

# progress.detail.empty.recent_volume.message
source: This exercise needs more completed sessions before its weekly volume pattern is useful.
es_mx: Este ejercicio necesita más sesiones completadas antes de que su patrón semanal de volumen sea útil.

# progress.detail.empty.recent_volume.title
source: Weekly volume is still building
es_mx: El volumen semanal todavía se está formando

# progress.detail.failure_title
source: Couldn’t load exercise progress
es_mx: No se pudo cargar el progreso del ejercicio

# progress.detail.header_subtitle
source: A focused view of personal records, weekly volume, and recent performance samples for this exercise.
es_mx: Una vista centrada en récords personales, volumen semanal y muestras recientes de rendimiento para este ejercicio.

# progress.detail.loading
source: Loading exercise progress…
es_mx: Cargando progreso del ejercicio…

# progress.detail.low_data.insufficient
source: Log more completed sets for this exercise to unlock personal records, weekly volume, and performance history.
es_mx: Registra más series completadas para este ejercicio y desbloquea récords personales, volumen semanal e historial de rendimiento.

# progress.detail.low_data.partial.empty
source: This exercise has a little history, but it still needs more completed sets before the trend becomes trustworthy.
es_mx: Este ejercicio tiene algo de historial, pero todavía necesita más series completadas antes de que la tendencia sea confiable.

# progress.detail.low_data.partial.some
source: Some signals are already useful, while volume and PR trends will get stronger with more logged sets.
es_mx: Algunas señales ya son útiles, mientras que el volumen y las tendencias de PR se fortalecerán con más series registradas.

# progress.detail.metric.best_estimate_on
source: Best estimate on %@
es_mx: Mejor estimación el %@

# progress.detail.metric.estimated_1rm
source: Estimated 1RM
es_mx: 1RM estimado

# progress.detail.metric.estimated_1rm_short
source: Est. 1RM %@
es_mx: 1RM est. %@

# progress.detail.metric.latest_top_set
source: Latest top set
es_mx: Última serie principal

# progress.detail.metric.logged_on
source: Logged on %@
es_mx: Registrada el %@

# progress.detail.metric.logged_top_set
source: Logged top set
es_mx: Serie principal registrada

# progress.detail.performance.planned_rest
source: Planned rest %@
es_mx: Descanso planificado %@

# progress.detail.performance.rest
source: Rest %@
es_mx: Descanso %@

# progress.detail.performance.value.completed_set
source: Completed set
es_mx: Serie completada

# progress.detail.performance.value.logged_set
source: Logged set
es_mx: Serie registrada

# progress.detail.performance.value.reps_only
source: %lld reps
es_mx: %lld repeticiones

# progress.detail.personal_record.achieved
source: Achieved %@
es_mx: Logrado %@

# progress.detail.personal_record.best_estimated_1rm
source: Best est. 1RM
es_mx: Mejor 1RM est.

# progress.detail.personal_record.best_session_volume
source: Best session volume
es_mx: Mejor volumen de sesión

# progress.detail.personal_record.heaviest_weight
source: Heaviest weight
es_mx: Peso más alto

# progress.detail.personal_record.most_reps
source: Most reps
es_mx: Más repeticiones

# progress.detail.personal_record.new_pr
source: New PR
es_mx: Nuevo PR

# progress.detail.personal_record.previous
source: Prev %@
es_mx: Ant. %@

# progress.detail.section.personal_records
source: Personal records
es_mx: Récords personales

# progress.detail.section.recent_performance
source: Recent performance
es_mx: Rendimiento reciente

# progress.detail.section.recent_volume
source: Recent volume
es_mx: Volumen reciente

# progress.detail.title
source: Exercise Progress
es_mx: Progreso del ejercicio

# progress.detail.unavailable
source: Exercise progress isn’t available yet.
es_mx: El progreso del ejercicio todavía no está disponible.

# progress.detail.week.prefix
source: Week of %@
es_mx: Semana de %@

# progress.detail.week.sets
source: %lld sets
es_mx: %lld series

# progress.detail.week.subtitle
source: %lld sets • %lld reps
es_mx: %lld series • %lld repeticiones

# progress.detail.week.total_load
source: %@ total load
es_mx: %@ carga total

# progress.empty.low_data.title
source: Progress is starting to build
es_mx: El progreso apenas comienza a formarse

# progress.empty.no_workouts.message
source: Finish a few workouts and this dashboard will start showing strength, volume, consistency, and efficiency trends.
es_mx: Completa algunos entrenamientos y este panel comenzará a mostrar tendencias de fuerza, volumen, consistencia y eficiencia.

# progress.empty.no_workouts.title
source: No completed workouts yet
es_mx: Aún no hay entrenamientos completados

# progress.section.strength
source: Strength training
es_mx: Entrenamiento de fuerza

# progress.section.strength.subtitle
source: Volume, consistency, recovery, and featured lifts are shown below.
es_mx: El volumen, la constancia, la recuperación y los levantamientos destacados se muestran abajo.

# progress.section.tracked_activities
source: Tracked activities
es_mx: Actividades registradas

# progress.section.tracked_activities.subtitle
source: Walking, running, hiking, and yoga summaries stay separate from your strength trends.
es_mx: Los resúmenes de caminar, correr, senderismo y yoga se mantienen separados de tus tendencias de fuerza.

# progress.title
source: Progress
es_mx: Progreso

source: Quick Start
es_mx: Inicio rápido

source: Quick Workout
es_mx: Entrenamiento rápido

source: Range
es_mx: Rango

source: Rate
es_mx: Tasa

source: Ready to start this routine.
es_mx: Lista para iniciar esta rutina.

source: Ready to start this workout.
es_mx: Todo listo para iniciar este entrenamiento.

source: Recent
es_mx: Reciente

source: Recurrence
es_mx: Recurrencia

source: Reflected
es_mx: Con reflexión

source: Reflection
es_mx: Reflexión

source: Reflection rate
es_mx: Tasa de reflexión

source: Reflections
es_mx: Reflexiones

source: Reinstall Catalog Assets
es_mx: Reinstalar recursos del catálogo

source: Reinstall is idempotent: it creates missing routines/exercises and refreshes the slug mapping without overwriting your custom routines.
es_mx: La reinstalación es idempotente: crea rutinas/ejercicios faltantes y actualiza el mapeo de slugs sin sobrescribir tus rutinas personalizadas.

source: Reload tip options
es_mx: Recargar opciones de propina

source: Remote media
es_mx: Medios remotos

source: Reopen
es_mx: Reabrir

source: Repeats
es_mx: Repeticiones

source: Replace existing
es_mx: Reemplazar existente

source: Report a bug
es_mx: Reportar un error

source: Reps
es_mx: Repeticiones

source: Reps/seconds over time
es_mx: Repeticiones/segundos a lo largo del tiempo

source: Required routines not installed
es_mx: Las rutinas requeridas no están instaladas

source: Reset and Reinstall Catalog Assets
es_mx: Restablecer y reinstalar recursos del catálogo

source: Reset clears the slug → UUID mapping file. After reset, Programs may appear “not schedulable” until you reinstall catalog assets (this screen will do it for you).
es_mx: Restablecer borra el archivo de mapeo slug → UUID. Después del restablecimiento, los Programas pueden aparecer como “no programables” hasta que reinstales los recursos del catálogo (esta pantalla lo hará por ti).

source: Reset Program Asset Map
es_mx: Restablecer mapa de recursos del programa

source: Reset Program Asset Map?
es_mx: ¿Restablecer mapa de recursos del programa?

source: Resize
es_mx: Redimensionar

source: Rest
es_mx: Descanso

source: Restore
es_mx: Restaurar

source: Restore Settings From Backup
es_mx: Restaurar configuración desde respaldo

source: Restore Workout Data
es_mx: Restaurar datos de entrenamientos

source: Resume
es_mx: Reanudar

source: Resume current workout
es_mx: Reanudar el entrenamiento actual

source: Resume current workout?
es_mx: ¿Reanudar el entrenamiento actual?

source: Resume unfinished workouts here. Sessions from previous days can be finished quickly so they stop appearing on Home.
es_mx: Reanuda aquí los entrenamientos sin terminar. Las sesiones de días anteriores se pueden finalizar rápidamente para que dejen de aparecer en Inicio.

source: Resume workout
es_mx: Reanudar entrenamiento

source: Review past sessions
es_mx: Revisar sesiones anteriores

source: Routine
es_mx: Rutina

source: Routine “%@” has no linked exercises. Reinstall the pack or fix the routine.
es_mx: La rutina “%@” no tiene ejercicios vinculados. Reinstala el paquete o corrige la rutina.

# routine.link.cool_down.clear
source: Remove cool-down link
es_mx: Quitar vínculo de enfriamiento

# routine.link.cool_down.empty
source: No cool-down linked
es_mx: No hay enfriamiento vinculado

# routine.link.cool_down.helper
source: Choose a reusable routine that should run after the main work.
es_mx: Elige una rutina reutilizable que deba ejecutarse después del trabajo principal.

# routine.link.cool_down.picker_title
source: Pick Cool-Down
es_mx: Elegir enfriamiento

# routine.link.cool_down.title
source: Cool-down
es_mx: Enfriamiento

# routine.link.warm_up.clear
source: Remove warm-up link
es_mx: Quitar vínculo de calentamiento

# routine.link.warm_up.empty
source: No warm-up linked
es_mx: No hay calentamiento vinculado

# routine.link.warm_up.helper
source: Choose a reusable routine that should run before the main work.
es_mx: Elige una rutina reutilizable que deba ejecutarse antes del trabajo principal.

# routine.link.warm_up.picker_title
source: Pick Warm-Up
es_mx: Elegir calentamiento

# routine.link.warm_up.title
source: Warm-up
es_mx: Calentamiento

source: Routines
es_mx: Rutinas

# routines.context.start
source: Start
es_mx: Iniciar

# routines.delete.confirmation.message
source: This cannot be undone.
es_mx: Esto no se puede deshacer.

# routines.delete.confirmation.title
source: Delete routine?
es_mx: ¿Eliminar rutina?

# routines.empty.message
source: Create your first routine to reuse it in your calendar or start it instantly.
es_mx: Crea tu primera rutina para reutilizarla en tu calendario o iniciarla al instante.

# routines.empty.title
source: No routines yet
es_mx: Aún no hay rutinas

# routines.row.starter_badge
source: Starter
es_mx: Inicial

# routines.row.tap_to_edit
source: Tap to edit
es_mx: Toca para editar

# routines.schedule.confirmation
source: “%@” scheduled for %@.
es_mx: “%1$@” programada para %2$@.

# routines.scheduled.open_calendar
source: Open Calendar
es_mx: Abrir calendario

# routines.scheduled.title
source: Scheduled
es_mx: Programada

# routines.title
source: Routines
es_mx: Rutinas

source: Row
es_mx: Fila

source: Sat
es_mx: Sáb

source: Save
es_mx: Guardar

source: Schedulable
es_mx: Programable

source: Schedule
es_mx: Programar

source: Schedule Program
es_mx: Programar plan

source: Schedule Template
es_mx: Plan programado

source: Schedule templates
es_mx: Plan programado

source: Schedule Templates
es_mx: Planes programados

source: Schedule this program
es_mx: Programar este plan

source: Schema v%lld
es_mx: Esquema v%lld

source: Scope
es_mx: Alcance

source: Search routines or exercises
es_mx: Buscar rutinas o ejercicios

source: Seconds over time
es_mx: Segundos a lo largo del tiempo

source: See all
es_mx: Ver todo

source: Segment
es_mx: Segmento

source: Select 2 sessions to compare.
es_mx: Selecciona 2 sesiones para comparar.

source: Select JSON Backup File
es_mx: Seleccionar archivo de respaldo JSON

source: Session recovery
es_mx: Recuperación de sesión

# session.abandon_workout.action
source: Abandon
es_mx: Abandonar

# session.abandon_workout.message
source: This will mark the session as abandoned (not completed).
es_mx: Esto marcará la sesión como abandonada (no completada).

# session.abandon_workout.title
source: Abandon session?
es_mx: ¿Abandonar sesión?

# session.attention.needs_attention
source: Needs attention
es_mx: Necesita atención

# session.coach.next_set
source: %@ next set
es_mx: Siguiente serie: %1$@

# session.continue
source: Continue
es_mx: Continuar

# session.empty.message
source: Create routines later. For now you can Quick Start and finish the session.
es_mx: Crea rutinas después. Por ahora puedes usar Inicio rápido y terminar la sesión.

# session.empty.title
source: No exercises yet
es_mx: Aún no hay ejercicios

# session.finish_workout.action
source: Finish & Save
es_mx: Finalizar y guardar

# session.finish_workout.cancel
source: Keep Logging
es_mx: Seguir registrando

# session.finish_workout.message
source: This will mark the session as completed.
es_mx: Esto marcará la sesión como completada.

# session.finish_workout.title
source: Finish workout?
es_mx: ¿Finalizar entrenamiento?

# session.finish.button
source: Finish
es_mx: Finalizar

# session.next_target
source: Next: %@
es_mx: Siguiente: %1$@

# session.pr.reps
source: %d reps
es_mx: %d repeticiones

# session.pr.section_title
source: Personal Records
es_mx: Récords personales

# session.pr.set_number
source: Set %d
es_mx: Serie %d

# session.progress.sets_value
source: %d/%d sets
es_mx: %d/%d series

# session.progress.title
source: Progress
es_mx: Progreso

# session.recovery.previous_day.message
source: This unfinished workout belongs to %@. Resume it, finish it now, discard it, or keep it for later without being prompted again today.
es_mx: Este entrenamiento sin terminar corresponde al %@. Reanúdalo, finalízalo ahora, descártalo o déjalo para después sin volver a mostrar este aviso hoy.

# session.recovery.previous_day.title
source: Previous-day unfinished workout
es_mx: Entrenamiento sin terminar del día anterior

# session.recovery.title
source: Session recovery
es_mx: Recuperación de sesión

# session.reflection.add
source: Add Reflection
es_mx: Agregar reflexión

# session.reflection.edit
source: Edit Reflection
es_mx: Editar reflexión

# session.reflection.mood
source: Mood
es_mx: Estado de ánimo

# session.reflection.title
source: Reflection
es_mx: Reflexión

# session.rest.finish
source: Finish rest
es_mx: Terminar descanso

# session.rest.hide
source: Hide Rest
es_mx: Ocultar descanso

# session.rest.overdue
source: Overdue
es_mx: Excedido

# session.rest.paused
source: Paused
es_mx: Pausado

# session.rest.ready
source: Ready
es_mx: Listo

# session.rest.title
source: Rest
es_mx: Descanso

# session.resume
source: Resume
es_mx: Reanudar
